Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: To ensure safety, gMock checks that (let U be the type m accepts :
it_it: Per garantire la sicurezza, gMock verifica che sia U il tipo accettato da m:

source: To ensure safety, gMock checks that (let `U` be the type `m` accepts :
it_it: Per garantire la sicurezza, gMock verifica che sia `U` il tipo accettato da `m`:

source: To fix that, use `using` to bring them in scope:
it_it: Per risolvere questo problema, usare `using` per inserirli nello scope:

source: To generate the JSON report, set the `GTEST_OUTPUT` environment variable or the `--gtest_output` flag to the string `"json:path_to_output_file"`, which will create the file at the given location.
it_it: Per generare il report JSON, si imposta la variabile di ambiente `GTEST_OUTPUT` o il flag `--gtest_output` con la stringa `"json:path_to_output_file"`, che creerà il file nella posizione specificata.

source: To generate the XML report, set the GTEST_OUTPUT environment variable or the --gtest_output flag to the string "xml:path_to_output_file", which will create the file at the given location.
it_it: Per generare il report XML, si imposta la variabile di ambiente GTEST_OUTPUT o il flag --gtest_output con la stringa "xml:path_to_output_file", che creerà il file nella posizione specificata.

source: To generate the XML report, set the `GTEST_OUTPUT` environment variable or the `--gtest_output` flag to the string `"xml:path_to_output_file"`, which will create the file at the given location.
it_it: Per generare il report XML, si imposta la variabile di ambiente `GTEST_OUTPUT` o il flag `--gtest_output` con la stringa `"xml:path_to_output_file"`, che creerà il file nella posizione specificata.

source: To help you determine which capability is available on your system, GoogleTest defines macros to govern which regular expression it is using.
it_it: Per aiutare a determinare quale funzionalità è disponibile sul sistema, GoogleTest definisce le macro per governare quale espressione regolare sta utilizzando.

source: To implement a matcher for type T using the legacy API you have to derive from MatcherInterface<T> and call MakeMatcher to construct the object.
it_it: Per implementare un matcher per il tipo T utilizzando l'API legacy si deve derivare da MatcherInterface<T> e chiamare MakeMatcher per costruire l'oggetto.

source: To implement a matcher for type `T` using the legacy API you have to derive from `MatcherInterface<T>` and call `MakeMatcher` to construct the object.
it_it: Per implementare un matcher per il tipo `T` utilizzando l'API legacy si deve derivare da `MatcherInterface<T>` e chiamare `MakeMatcher` per costruire l'oggetto.

source: To include disabled tests in test execution, just invoke the test program with the --gtest_also_run_disabled_tests flag or set the GTEST_ALSO_RUN_DISABLED_TESTS environment variable to a value other than 0.
it_it: Per includere test disabilitati nell'esecuzione del test, è sufficiente richiamare il programma di test con il flag --gtest_also_run_disabled_tests o impostare la variabile d'ambiente GTEST_ALSO_RUN_DISABLED_TESTS su un valore diverso da 0.

source: To include disabled tests in test execution, just invoke the test program with the --gtest_also_run_disabled_tests flag.
it_it: Per includere i test disabilitati nell'esecuzione del test, basta richiamare il programma di test con il flag --gtest_also_run_disabled_tests.

source: To include disabled tests in test execution, just invoke the test program with the `--gtest_also_run_disabled_tests` flag or set the `GTEST_ALSO_RUN_DISABLED_TESTS` environment variable to a value other than `0`.
it_it: Per includere test disabilitati nell'esecuzione del test, è sufficiente richiamare il programma di test con il flag `--gtest_also_run_disabled_tests` o impostare la variabile d'ambiente `GTEST_ALSO_RUN_DISABLED_TESTS` su un valore diverso da `0`.

source: To include disabled tests in test execution, just invoke the test program with the `--gtest_also_run_disabled_tests` flag.
it_it: Per includere i test disabilitati nell'esecuzione del test, basta richiamare il programma di test con il flag `--gtest_also_run_disabled_tests`.

source: To learn about POSIX syntax, you may want to read this Wikipedia entry.
it_it: Per conoscere la sintassi POSIX, si potrebbe leggere questa voce di Wikipedia.

source: To learn about POSIX syntax, you may want to read this [Wikipedia entry](https://en.wikipedia.org/wiki/Regular_expression#POSIX_extended).
it_it: Per conoscere la sintassi POSIX, si potrebbe leggere questa [voce di Wikipedia](https://en.wikipedia.org/wiki/Regular_expression#POSIX_extended).

source: To learn more about ULPs, see the article Comparing Floating Point Numbers.
it_it: Per ulteriori informazioni sugli ULP, consultare l'articolo Confronto tra Numeri in Virgola Mobile.

source: To learn more about ULPs, see the article [Comparing Floating Point Numbers](https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/).
it_it: Per ulteriori informazioni sugli ULP, consultare l'articolo [Confronto tra Numeri in Virgola Mobile](https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/).

source: To learn when you should use the constructor/destructor and when you should use SetUp()/TearDown(), read the FAQ.
it_it: Per sapere quando usare il costruttore/distruttore e quando usare SetUp()/TearDown(), leggere le FAQ.

source: To learn when you should use the constructor/destructor and when you should use `SetUp()/TearDown()`, read the [FAQ](faq.md#CtorVsSetUp).
it_it: Per sapere quando usare il costruttore/distruttore e quando usare `SetUp()/TearDown()`, leggere le [FAQ](faq.md#CtorVsSetUp).

source: To make it even easier, you can add the following lines to your ~/.emacs file:
it_it: Per semplificarlo ulteriormente, si possono aggiungere le seguenti righe al file ~/.emacs:

source: To make it even easier, you can add the following lines to your `~/.emacs` file:
it_it: Per semplificarlo ulteriormente, si possono aggiungere le seguenti righe al file `~/.emacs`:

source: To make your life easier, gMock dumps the stack trace when an uninteresting call is encountered.
it_it: Per semplificarci la vita, gMock scarica l'analisi dello stack quando viene incontrata una chiamata poco interessante.

source: To mock
it_it: Per il mock di

source: To mock a method that accepts or returns move-only types, you just use the familiar MOCK_METHOD syntax as usual:
it_it: Per il mock di un metodo che accetta o restituisce tipi move-only, si usa semplicemente la familiare sintassi MOCK_METHOD:

source: To mock a method that accepts or returns move-only types, you just use the familiar `MOCK_METHOD` syntax as usual:
it_it: Per il mock di un metodo che accetta o restituisce tipi move-only, si usa semplicemente la familiare sintassi `MOCK_METHOD`:

source: To mock side effects, in general you can define your own action by implementing ::testing::ActionInterface.
it_it: Per mock-are gli oggetti collaterali, in generale si può definire la propria azione implementando ::testing::ActionInterface.

source: To mock side effects, in general you can define your own action by implementing `::testing::ActionInterface`.
it_it: Per mock-are gli oggetti collaterali, in generale si può definire la propria azione implementando `::testing::ActionInterface`.

source: To obtain a TestInfo object for the currently running test, call current_test_info() on the UnitTest singleton object:
it_it: Per ottenere un oggetto TestInfo per il test attualmente in esecuzione, si chiama current_test_info() sull'oggetto singleton UnitTest:

source: To obtain a `TestInfo` object for the currently running test, call `current_test_info()` on the [`UnitTest`](reference/testing.md#UnitTest) singleton object:
it_it: Per ottenere un oggetto `TestInfo` per il test attualmente in esecuzione, si chiama `current_test_info()` sull'oggetto singleton [`UnitTest`](reference/testing.md#UnitTest):

source: To override these functions, place definitions for them in a source file that you compile as part of your main binary:
it_it: Per sovrascrivere queste funzioni, si inseriscono le relative definizioni in un file sorgente che si compila come parte del binario principale:

source: To please the compiler God, you need to define an "adaptor" that has the same signature as Foo() and calls the custom action with the right arguments:
it_it: Per compiacere il dio del compilatore, si deve definire un "adaptor" che abbia la stessa firma di Foo() e si chiama l'azione personalizzata con gli argomenti giusti:

source: To please the compiler God, you need to define an "adaptor" that has the same signature as `Foo()` and calls the custom action with the right arguments:
it_it: Per compiacere il dio del compilatore, si deve definire un "adaptor" che abbia la stessa firma di `Foo()` e si chiama l'azione personalizzata con gli argomenti giusti:

source: To provide a custom failure message, simply stream it into the macro using the << operator or a sequence of such operators.
it_it: Per avere un messaggio di errore personalizzato, è sufficiente inserirlo nella macro utilizzando l'operatore << o una sequenza di tali operatori.

source: To provide a custom failure message, simply stream it into the macro using the `<<` operator or a sequence of such operators.
it_it: Per avere un messaggio di errore personalizzato, è sufficiente inserirlo nella macro utilizzando l'operatore `<<` o una sequenza di tali operatori.

source: To provide more readable messages in Boolean assertions (e.g. EXPECT_TRUE()), write a predicate function that returns AssertionResult instead of bool.
it_it: Per avere messaggi più leggibili nelle asserzioni booleane (ad esempio EXPECT_TRUE()), si scrive una funzione predicato che restituisca AssertionResult anziché bool.

source: To provide more readable messages in Boolean assertions (e.g. `EXPECT_TRUE()`), write a predicate function that returns `AssertionResult` instead of `bool`.
it_it: Per avere messaggi più leggibili nelle asserzioni booleane (ad esempio `EXPECT_TRUE()`), si scrive una funzione predicato che restituisca `AssertionResult` anziché `bool`.

source: To run the test functions in parallel, you would set GTEST_TOTAL_SHARDS to 3 on all machines, and set GTEST_SHARD_INDEX to 0, 1, and 2 on the machines respectively.
it_it: Per eseguire le funzioni di test in parallelo, si imposta GTEST_TOTAL_SHARDS a 3 su tutte le macchine, e si setta GTEST_SHARD_INDEX a 0, 1, e 2 sulle macchine rispettivamente.

source: To run the test functions in parallel, you would set `GTEST_TOTAL_SHARDS` to 3 on all machines, and set `GTEST_SHARD_INDEX` to 0, 1, and 2 on the machines respectively.
it_it: Per eseguire le funzioni di test in parallelo, si imposta `GTEST_TOTAL_SHARDS` a 3 su tutte le macchine, e si setta `GTEST_SHARD_INDEX` a 0, 1, e 2 sulle macchine rispettivamente.

source: To see a list of supported flags and their usage, please run your test program with the --help flag.
it_it: Per visualizzare un elenco dei flag supportati e il loro utilizzo, eseguire il programma di test con il flag --help.

source: To see a list of supported flags and their usage, please run your test program with the `--help` flag.
it_it: Per visualizzare un elenco dei flag supportati e il loro utilizzo, eseguire il programma di test con il flag `--help`.

source: To show only test failures, run the test program with --gtest_brief=1, or set the GTEST_BRIEF environment variable to 1.
it_it: Per mostrare solo i test falliti, eseguire il programma di test con --gtest_brief=1, o impostare la variabile di ambiente GTEST_BRIEF a 1.

source: To show only test failures, run the test program with `--gtest_brief=1`, or set the GTEST_BRIEF environment variable to `1`.
it_it: Per mostrare solo i test falliti, eseguire il programma di test con `--gtest_brief=1`, o impostare la variabile di ambiente GTEST_BRIEF a `1`.

source: To solve this problem, you can
it_it: Per risolvere questo problema, si può

source: To specify the random seed explicitly, use the --gtest_random_seed=SEED flag (or set the GTEST_RANDOM_SEED environment variable), where SEED is an integer in the range 0, 99999.
it_it: Per specificare esplicitamente il seed casuale, si usa il flag --gtest_random_seed=SEED (o si imposta la variabile di ambiente GTEST_RANDOM_SEED), dove SEED è un numero intero nell'intervallo 0, 99999.

source: To specify the random seed explicitly, use the `--gtest_random_seed=SEED` flag (or set the `GTEST_RANDOM_SEED` environment variable), where `SEED` is an integer in the range [0, 99999].
it_it: Per specificare esplicitamente il seed casuale, si usa il flag `--gtest_random_seed=SEED` (o si imposta la variabile di ambiente `GTEST_RANDOM_SEED`), dove `SEED` è un numero intero nell'intervallo [0, 99999].

source: To support this need, gMock gives you the SafeMatcherCast<T>(m) function.
it_it: Per supportare questa esigenza, gMock offre la funzione SafeMatcherCast<T>(m).

source: To support this need, gMock gives you the `SafeMatcherCast<T>(m)` function.
it_it: Per supportare questa esigenza, gMock offre la funzione `SafeMatcherCast<T>(m)`.

source: To support this, Google provides --gtest_filter=<test string>.
it_it: Per supportare ciò, Google fornisce --gtest_filter=<test string>.

source: To suppress the default printer, just release it from the event listener list and delete it.
it_it: Per sopprimere la stampante di default , basta rilasciarla dall'elenco del listener di eventi ed eseguirne il delete.

source: To take advantage of this feature, your test runner (not part of GoogleTest) needs to do the following:
it_it: Per sfruttare questa funzione, il test runner (non parte di GoogleTest) deve effettuare le seguenti operazioni:

source: To test them, we use the following special techniques:
it_it: Per testarli, utilizziamo le seguenti tecniche speciali:

source: To test them, you can #include the entire .cc file being tested in your *_test.cc file.
it_it: Per testarli, si può #include-re l'intero file .cc da testare nel file *_test.cc.

source: To test them, you can `#include` the entire `.cc` file being tested in your `*_test.cc` file.
it_it: Per testarli, si può `#include`-re l'intero file `.cc` da testare nel file `*_test.cc`.

source: To use MockFunction, first create MockFunction object and set up expectations on its Call method.
it_it: Per utilizzare MockFunction, si crea prima un oggetto MockFunction e si impostano le expectation sul suo metodo Call.

source: To use `MockFunction`, first create `MockFunction` object and set up expectations on its `Call` method.
it_it: Per utilizzare `MockFunction`, si crea prima un oggetto `MockFunction` e si impostano le expectation sul suo metodo `Call`.

source: To use it:
it_it: Per usarlo:

source: To use the event listener you have defined, add an instance of it to the GoogleTest event listener list (represented by class TestEventListeners - note the "s" at the end of the name) in your main() function, before calling RUN_ALL_TESTS():
it_it: Per usare l'event listener definito, se ne aggiunge un'istanza alla lista degli event listener di GoogleTest (rappresentata dalla classe TestEventListeners - notare la "s" alla fine del nome) nella funzione main(), prima di chiamare RUN_ALL_TESTS():

source: To use the event listener you have defined, add an instance of it to the GoogleTest event listener list (represented by class [`TestEventListeners`](reference/testing.md#TestEventListeners) - note the "s" at the end of the name) in your `main()` function, before calling `RUN_ALL_TESTS()`:
it_it: Per usare l'event listener definito, se ne aggiunge un'istanza alla lista degli event listener di GoogleTest (rappresentata dalla classe [`TestEventListeners`](reference/testing.md#TestEventListeners) - notare la "s" alla fine del nome) nella funzione `main()`, prima di chiamare `RUN_ALL_TESTS()`:

source: To use them, add #include <gmock/gmock.h>.
it_it: Per usarli, si aggiunge #include <gmock/gmock.h>.

source: To use them, add #include <gtest/gtest.h>.
it_it: Per usarle, si aggiunge #include <gtest/gtest.h>.

source: To use them, add `#include <gmock/gmock.h>`.
it_it: Per usarli, si aggiunge `#include <gmock/gmock.h>`.

source: To use them, add `#include <gtest/gtest.h>`.
it_it: Per usarle, si aggiunge `#include <gtest/gtest.h>`.

source: To write a death test, simply use one of the macros inside your test function.
it_it: Per scrivere un death test, basta usare una delle macro nella funzione di test.

source: To write death tests you really need to understand how they work—see the details at Death Assertions in the Assertions Reference.
it_it: Per scrivere dei death test si devono veramente capire come funzionano: vederei i dettagli nelle Asserzioni Death nei Riferimenti sulle Asserzioni.

source: To write death tests you really need to understand how they work—see the details at [Death Assertions](reference/assertions.md#death) in the Assertions Reference.
it_it: Per scrivere dei death test si devono veramente capire come funzionano: vederei i dettagli nelle [Asserzioni Death](reference/assertions.md#death) nei Riferimenti sulle Asserzioni.

source: To write value-parameterized tests, first you should define a fixture class.
it_it: Per scrivere test con valori parametrizzati, è necessario innanzitutto definire una classe fixture.

source: Trouble is, the custom action only wants three arguments:
it_it: Il problema è che l'azione personalizzata richiede solo tre argomenti:

source: Try not to do that.
it_it: Cercare di non farlo.

source: Turning Assertion Failures into Break-Points
it_it: Trasformare gli Errori delle Asserzioni in Break-Point

source: Type T can be implicitly cast to type U;
it_it: Il tipo T può essere convertito [cast] implicitamente nel tipo U;

source: Type Assertions
it_it: Tipi di Asserzioni

source: Type `T` can be *implicitly* cast to type `U`;
it_it: Il tipo `T` può essere convertito [cast] *implicitamente* nel tipo `U`;

source: Type-Parameterized Tests
it_it: Test con i Tipi Parametrizzati

source: Typed Test example
it_it: Esempio di Test Tipizzato

source: Typed Tests
it_it: Test Tipizzati

source: Typed tests can be easier to write if instances of the different implementations can be created the same way, modulo the type.
it_it: I test tipizzati possono essere più facili da scrivere se le istanze delle diverse implementazioni possono essere create allo stesso modo, modulo il tipo.

source: Types {#Types}
it_it: Tipi {#Types}

source: Typically the OnceAction and Action templates need not be referenced directly in your actions: a struct or class with a call operator is sufficient, as in the examples above.
it_it: In genere non è necessario fare riferimento direttamente ai template OnceAction e Action nelle action: basta una struct o una classe con un operatore di chiamata, come negli esempi precedenti.

source: Typically the `OnceAction` and `Action` templates need not be referenced directly in your actions: a struct or class with a call operator is sufficient, as in the examples above.
it_it: In genere non è necessario fare riferimento direttamente ai template `OnceAction` e `Action` nelle action: basta una struct o una classe con un operatore di chiamata, come negli esempi precedenti.

source: Typically, different central processing units (CPUs) and operating environments store floating points differently and simple comparisons between expected and actual values don't work.
it_it: In genere, diverse unità di elaborazione centrale (CPU) e ambienti operativi memorizzano i numeri in virgola mobile in modo diverso e i semplici confronti tra i valori attesi e quelli effettivi non funzionano.

source: Typically, your code looks like this:
it_it: In genere, il codice è simile al seguente:

source: URL https://github.com/google/googletest/archive/03597a01ee50ed33e9dfd640b249b4be3799d395.zip ) # For Windows: Prevent overriding the parent project's compiler/linker settings set(gtest_force_shared_crt ON CACHE BOOL "" FORCE) FetchContent_MakeAvailable(googletest)
it_it: URL https://github.com/google/googletest/archive/03597a01ee50ed33e9dfd640b249b4be3799d395.zip ) # Per Windows: Previene l'overriding delle impostazioni del compilatore compiler/linker del progetto genitore set(gtest_force_shared_crt ON CACHE BOOL "" FORCE) FetchContent_MakeAvailable(googletest)

source: Under the hood, a gMock matcher object consists of a pointer to a ref-counted implementation object.
it_it: Internamente, un oggetto matcher gMock è costituito da un puntatore a un oggetto di implementazione con conteggio dei riferimenti.

source: Underscore (_) is special, as C++ reserves the following to be used by the compiler and the standard library:
it_it: Underscore (_) è speciale, poiché il C++ riserva quanto segue per essere utilizzato dal compilatore e dalla libreria standard:

source: Underscore (`_`) is special, as C++ reserves the following to be used by the compiler and the standard library:
it_it: Underscore (`_`) è speciale, poiché il C++ riserva quanto segue per essere utilizzato dal compilatore e dalla libreria standard:

source: Understanding Uninteresting vs Unexpected Calls {#uninteresting-vs-unexpected}
it_it: Le Chiamate Poco Interessanti e Quelle Unexpected {#uninteresting-vs-unexpected}

source: Understanding test fixtures
it_it: Capire le fixture

source: Unfortunately, it doesn't work here.
it_it: Sfortunatamente, qui non funziona.

source: Unfortunately, the C++ macro system does not allow us to create a single macro that can handle both types of tests.
it_it: Sfortunatamente, il sistema delle macro di C++ non ci consente di creare un'unica macro per gestire entrambi i tipi di test.

source: Uninteresting Calls
it_it: Chiamate Non Interessanti

source: Unit test for the square root function
it_it: Unit test per la funzione radice quadrata

source: UnitTest reflects the state of the entire test program,
it_it: UnitTest riflette lo stato dell'intero programma di test,

source: Unlike WillRepeatedly, the action fed to each WillOnce call will be called at most once, so may be a move-only type and/or have an &&-qualified call operator.
it_it: Diversamente da WillRepeatedly, la action fornita a ciascuna chiamata WillOnce verrà chiamata al massimo una volta, quindi potrebbe essere di tipo move-only e/o avere un operatore di chiamata qualificato con &&.

source: Unlike TEST(), in TEST_F() the first argument must be the name of the test fixture class.
it_it: A differenza di TEST(), in TEST_F() il primo argomento deve essere il nome della classe della fixture di test.

source: Unlike `TEST()`, in `TEST_F()` the first argument must be the name of the test fixture class.
it_it: A differenza di `TEST()`, in `TEST_F()` il primo argomento deve essere il nome della classe della fixture di test.

source: Unlike `WillRepeatedly`, the action fed to each `WillOnce` call will be called at most once, so may be a move-only type and/or have an `&&`-qualified call operator.
it_it: Diversamente da `WillRepeatedly`, la action fornita a ciascuna chiamata `WillOnce` verrà chiamata al massimo una volta, quindi potrebbe essere di tipo move-only e/o avere un operatore di chiamata qualificato con `&&`.

source: Unlike the plain Contains and Each this allows to check for arbitrary occurrences including testing for absence with Contains(e).Times(0).
it_it: A differenza dei semplici Contains e Each questo consente di verificare la presenza di occorrenze arbitrarie, incluso il test per l'assenza con Contains(e).Times(0).
